In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(data = [[2,3],["Hello","World"],[34,True]],index = ["R1","R2","R3"])

In [3]:
df

        0      1
R1      2      3
R2  Hello  World
R3     34   True

## Reading and Writing .csv

In [4]:
df.to_csv("samplecsv.csv")

In [7]:
#df1 = pd.read_csv("samplecsv.csv") which makes our index column unidentifible

df1 = pd.read_csv("samplecsv.csv", index_col= 0)

In [8]:
df1

        0      1
R1      2      3
R2  Hello  World
R3     34   True

## .html

In [23]:
#http://en.wikipedia.org/wiki/The_World%27s_Billionaires#2015

In [24]:
list_tables = pd.read_html('http://en.wikipedia.org/wiki/The_World%27s_Billionaires#2015')

In [25]:
len(list_tables) #total no., of tables present in the page

27

In [26]:
type(list_tables) #type of content

list

In [28]:
list_tables[0] #side table near introduction is considered as 1st table

,0,1
0,"List of the world's billionaires, ranked in or...",NaN
1,NaN,NaN
2,The net worth of the world's billionaires incr...,NaN
3,Publication details,NaN
4,Publisher,Whale Media InvestmentsForbes family
5,Publication,Forbes
6,First published,March 1987[1]
7,Latest publication,"March 6, 2018"
8,Current list details (2018)[2],NaN
9,Wealthiest,Jeff Bezos
10,Net worth (1st),US$112 billion
11,Number of billionaires,2208
12,Total list net worth value,US$9.1 trillion
13,Average net worth,US$4.1 billion
14,Number of women,256
15,Number of people aged 40 years or less,63
16,New members to the list,259
17,Forbes: The World's Billionaires website,NaN

In [30]:
list_tables[4] #2015 billionaire table in html

,0,1,2,3,4,5
0,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
1,NaN,Bill Gates,$79.2 billion,59,United States,Microsoft
2,NaN,Carlos Slim,$77.1 billion,75,Mexico,"América Móvil, Telmex, Grupo Carso"
3,NaN,Warren Buffett,$72.7 billion,84,United States,Berkshire Hathaway
4,NaN,Amancio Ortega,$64.5 billion,78,Spain,Inditex
5,NaN,Larry Ellison,$54.3 billion,70,United States,Oracle Corporation
6,NaN,Charles Koch,$42.9 billion,79,United States,Koch Industries
7,NaN,David Koch,$42.9 billion,74,United States,Koch Industries
8,NaN,Christy Walton,$41.7 billion,66,United States,Walmart
9,NaN,Jim Walton,$40.6 billion,66,United States,Walmart
10,NaN,Liliane Bettencourt,$40.1 billion,92,France,L'Oreal

## excel

In [31]:
df

        0      1
R1      2      3
R2  Hello  World
R3     34   True

In [32]:
df.to_excel('sample_excel.xls')

In [35]:
df3 = pd.read_excel('sample_excel.xls')

In [36]:
df3

        0      1
R1      2      3
R2  Hello  World
R3     34   True